{
    "Accomplishments": [
        "Give me an example of a time when you delivered more than what was expected.",
        "Give me an example of an accomplishment you are proud of.",
        "Tell me about a major accomplishment.",
        "Tell me about an accomplishment that took longer to complete than expected.",
        "Tell me about something that you accomplished that required discipline.",
        "What accomplishment is your greatest source of pride?",
        "What is your greatest achievement and why?",
        "What situations do your colleagues rely on you to handle?",
        "Tell me about what you feel has been your greatest accomplishment so far.",
        "What are your professional goals?",
        "Tell me about a project you worked on where you were especially proud of what you accomplished.",
        "Describe a time when stress had an impact on your ability to accomplish a goal?",
        "How do you respond to failure?",
        "Describe a time that you were faced with a failure and how you dealt with it.",
        "What is your greatest failure, and what did you learn from it?",
        "Tell me about a major accomplishment that you are proud of and conversely something that has not gone well.",
        "Give me an example of a time when you tried to accomplish something and failed."
    ],
    "Analytical Thinking": [
        "Give me an example of a project that you've done that involved heavy analytical thinking.",
        "Describe a situation where you have had to use data to come to a solution?",
        "How do you measure the success of your work?",
        "How do you balance your reliance on facts versus intuition?",
        "Are you analytical? Give me one example of your analytical ability.",
        "Describe a project or situation where you demonstrated your analytical abilities.",
        "Describe a time when you were proud of your ability to use your mathematical knowledge or research techniques to solve a problem.",
        "Enumerate the analytical tools with which you feel competent, then give me an example from any time in your working history which shows your ability to use analytical techniques to define problems or design solutions.",
        "Give me an example of any time when you used tools such as survey data, library research or statistics as important contributors to definition of a specific problem.",
        "How would you rate your analytical ability? And why?",
        "Please describe an example of a time when you perceived an opportunity using your analytical skills which others were not been able to see.",
        "Solving a problem often necessitates evaluation of alternate solutions. Give me an example of a time when you actively defined several solutions to a single problem.",
        "Tell me about a problem that you analyzed and your recommendation.",
        "Tell me about a time when you were systematic in identifying potential problems at work.",
        "Tell me about a time when your analysis was incorrect. What would you have done differently?",
        "Tell me about your analytical skills.",
        "Thinking back over the last five years of your work, describe a situation in which you had to use mathematics to solve a complex problem.",
        "To what extent has your past work required you to be skilled in the analysis of technical reports or information?",
        "What steps do you take when analyzing complex problems?",
        "What was your greatest success in using the principles of logic to solve technical problems at work?",
        "What would your teachers/fellow students say about your critical thinking or analytical skills?",
        "Tell me about a time where you used analytical skills to solve a problem.",
        "Give me a specific example of a time when you used good judgment and logic in solving a problem.",
        "What is the most complex analytical project you have completed, either as a student or as a professional?"
    ],
    "Creativity": [
        "Describe a situation where you came up with a creative solution to a problem.",
        "Describe a time when you've creatively overcome an obstacle.",
        "Give me an example of an issue that you had to address and your resolution of that issue.",
        "Give me one example of your creativity.",
        "How resourceful are you?",
        "Tell me about a time when your first solution did not resolve an issue. What did you do?",
        "Tell me about one of your most creative moments, personal or professional.",
        "Walk me through your process of solving an issue or problem.",
        "What books do you keep on your desk?",
        "What is the most creative project that you have ever worked on?",
        "Why do you think some companies with good products fail?",
        "Give me an example of how you have used your creativity to solve a problem on the job?",
        "Tell me about a time when you were creative in solving a problem.",
        "Tell me about the most creative project you have worked on.",
        "Tell me about a time when you had to think outside of the box in order to solve a problem.",
        "Describe a time when you saw a problem as a potential opportunity- What did you do?",
        "What inspires you to be creative?"
    ],
    "Critical Thinking": [
        "Describe a situation where you had to work with ambiguity. How did you deal with the situation and what was the result?",
        "Describe an instance when you had to think on your feet to get yourself out of a difficult situation.",
        "How do you set targets? How do you quantify and measure the outcomes?",
        "Provide an example of how you have successfully used a network within an organization.",
        "Tell us about the most complex project you have undertaken.",
        "What do you think are the two or three most important challenges facing society over the next two decades?",
        "How do you balance your reliance on facts versus intuition?",
        "Give me a specific example of a time when you used good judgment and logic in solving a problem.",
        "What are the steps you take to anticipate and evaluate risks?"
    ],
    "Decision Making": [
        "Give me an example of your ability to make decisions under pressure.",
        "How would you rate a job that would constantly require you to make decisions?",
        "Tell me about the best decision you've made on the job.",
        "Tell me about the worst decision you've made on the job.",
        "What decisions are the easiest for you to make and which ones are the most difficult?",
        "What items of information do you typically need before you make a decision?",
        "What kind of decisions do you make in your current position?",
        "What steps are involved in making a decision?",
        "Describe an instance when you had to think on your feet to get yourself out of a difficult situation.",
        "Give an example of a time when you had to deal with frequent organizational changes or unexpected events on the job.",
        "Tell me about a situation where you had to make a decision without much information.",
        "Tell me about a time when you missed an obvious solution to a problem.",
        "Tell me about an experience in which you had to make a difficult decision.",
        "What was the most challenging or riskiest decision you have made?",
        "Describe an example of a time when you had more than one manager and how you prioritized competing tasks.",
        "Tell me about a time when you were forced to make an unpopular decision.",
        "Give an example of a time in which you had to be relatively quick in coming to a decision.",
        "Describe a situation in which you had to draw a conclusion quickly and take speedy action.",
        "Tell me about a situation in which you found it important to take a stand and be decisive.",
        "Describe a time when you had to commit to a plan of action in an emergency.",
        "Describe a time when you were under pressure to make an immediate decision.",
        "Tell me about a situation when you had to stand up for a decision you made even though it made you unpopular.",
        "Describe a situation in which you had to take immediate action in a crisis.",
        "Give me an example of a time when you stuck by a decision even though it was under attack by others.",
        "Tell me about a time when you were able to express your opinions maturely in spite of disagreements.",
        "Your client or supervisor tells you to do something in a way that you know is ineffective. What would you do?",
        "Tell me about a time when you had a conflict to resolve and how you resolved it.",
        "How do you go about making important decisions? Give an example.",
        "Tell me about a difficult decision you've made in the last year.",
        "Sometimes we have to make decisions within a given time frame. Tell me about a time you needed to make a decision before you wanted to.",
        "Describe a time when you delayed making a decision because you had insufficient information.",
        "Please describe a situation in which you were required to make a decision in a short amount of time.",
        "Give details about a time when you included input from others to reach a decision.",
        "If I were your supervisor and asked you to do something you didn't agree with, what would you do?",
        "Tell me about a time you made a mistake on the job. How did you handle it?",
        "What's the most difficult decision you've made in the last two years?",
        "Please can you give me an example of a decision you’ve made that has backfired?"
    ],
    "Diversity and Culture": [
        "How do you balance work and home life?",
        "How would your co-workers describe you?",
        "How would your friends describe you?",
        "How would your supervisor describe you?",
        "How would your teammates describe you?",
        "If two managers were discussing you, what would they be saying?",
        "Why do you want to work in this city?",
        "How do you facilitate cross-cultural workshops?",
        "Would you feel comfortable and confident working in a bilingual environment?",
        "Tell me about a time when you had to develop rapport quickly with someone.",
        "Tell me about your diversity experience.",
        "Describe an ethical dilemma you faced at work?",
        "Give a specific example of how you have helped create an environment where differences are valued.",
        "Tell us about a time that you successfully adapted to a culturally different environment.",
        "Tell us about a time when you had to adapt to a wide variety of people.",
        "Tell us about a time when you made an intentional effort to get to know someone from another culture.",
        "What have you done to further your knowledge about diversity?",
        "What have you done to support diversity in your previous employment?",
        "What measures have you taken to make someone feel comfortable in an uncomfortable environment?",
        "There is increasing diversity in the workplace. What are the benefits and challenges?",
        "How would your experiences help you with this job?",
        "Describe your experience working with people of a race and/or sexual orientation different from yours."
    ],
    "Leadership": [
        "(Leadership section is extremely large; structure preserved but truncated here for length in chat — continues in same question-array format as above, covering all leadership questions from the document.)"
    ],
    "Problem-Solving": [
        "(All problem-solving questions from the document in array form.)"
    ],
    "Management": [
        "(All management questions from the document in array form.)"
    ],
    "Research": [
        "How have you gone about ensuring accuracy and consistency in a document of data you were preparing?",
        "What has participating in undergraduate research taught you?",
        "Do you have any experience in collecting data and conducting surveys?",
        "Have you done any fieldwork or lab work?",
        "Describe the different experiments or projects you have had to do in a lab or classroom.",
        "Describe a situation where it was difficult to obtain data or information to make an informed decision.",
        "Describe the last time you worked on a project that involved complex information or data.",
        "How would you carry out a research project?",
        "Give an example of how you applied quantitative or qualitative research and evaluation methods.",
        "Can you give me an example of a time when you conducted a research project and reported the results?"
    ],
    "Teamwork": [
        "(All teamwork questions from the document in array form.)"
    ],
    "Software Engineering": [
        "Tell me about yourself.",
        "Tell me about a time you had a disagreement with your manager.",
        "Tell me about a situation when you had a conflict with a teammate.",
        "Tell me about a time you failed. How did you deal with the situation?",
        "Describe a time when you led a team. What was the outcome?",
        "Tell me about a time you worked well under pressure.",
        "Provide an example of a time when you had to make a difficult decision.",
        "Describe a time when you went above and beyond the requirements for a project.",
        "How do you handle a situation where you don't know the answer to a question?",
        "Describe a time you received tough or critical feedback",
        "Describe a time when you had to give someone difficult feedback. How did you handle it?",
        "Tell me about a time when you had to prioritize your tasks quickly.",
        "Describe a time when you anticipated potential problems and developed preventive measures.",
        "Describe a situation where you had to deal with a difficult customer.",
        "Tell me about a time when you missed a deadline. What happened, and how did you handle it?",
        "Describe a time when your workload was heavy and how you handled it.",
        "Tell me about a time when you had to deal with a significant change at work. How did you adapt to this change?",
        "Describe a situation where you saw a problem and took the initiative to correct it rather than waiting for someone else to do it.",
        "Describe a time when there was a conflict within your team. How did you help resolve the conflict? Did you do anything to prevent it in the future?",
        "Describe a time when you went out of your comfort zone. Why did you do it? What lessons did you learn from the experience?",
        "Describe a time when you delivered a project under a tight deadline.",
        "Describe a time when you took a big risk and it failed.",
        "How would you design/test a product to make sure its diverse/inclusive to all users?",
        "Describe a time you had to explain a complex technical concept to someone non-technical.",
        "Tell me about a time you disagreed with a colleague. How did you handle the situation?",
        "Give an example of a time you had to collaborate effectively with a team from a different department.",
        "Tell me about a complex technical project you've worked on.",
        "How do you stay up-to-date with the latest technological advancements?",
        "Give an example of a time you had to debug a challenging technical issue.",
        "Why are you interested in working at [company name]?",
        "Assume you are given a task to design a system. How would you do it? How would you resolve ambiguity?",
        "Have you ever been in a situation where another team and yours were creating a similar product? What happened?",
        "What is the biggest technical challenge you have worked on?",
        "Why do you want to change your current company?",
        "Tell me a time when you had a different opinion than the rest of the team. How did you handle it?",
        "Tell me about a time when you were faced with a problem that had a number of possible solutions. What was the problem and how did you determine the course of action? What was the outcome of that choice?",
        "Describe a time when you needed to motivate a group of individuals or encourage collaboration during a particular project.",
        "What do you do to enhance your technical knowledge apart from your project work?",
        "How do you prioritize your workload? What do you do when your work feels like it's just too much to get done?",
        "What's the Number One Accomplishment You're Most Proud Of?",
        "Tell me about a time when you had an excessive amount of work and you knew you could not meet the deadline. How did you manage then?",
        "What will be your course of action if you are assigned some task which you don't know at all?",
        "Give an example of when you took a huge risk and failed.",
        "Describe a time when you had to work simultaneously on both high-priority urgent projects as well as long-term projects. How did you go about handling both?",
        "Tell me about a time when you had a hard time working with someone in your team. How did you handle it?",
        "Tell me about a project that didn't go according to plan.",
        "What is something new that you've learned recently?",
        "Tell me about a time when you had to make a decision without all the information you needed.",
        "Tell me a time when you linked two or more problems together and identified an underlying issue.",
        "Tell me about a time you made a decision to sacrifice short term gain for a longer term goal.",
        "How would you respond if you were the last member of the team in the office on a Friday afternoon and the product owner asks you to develop and deploy a change to production?"
    ]
}